Tekla Open API Reference for Tekla Structures 2025
ModuleManager.Configuration Property
 The currently running configuration of Tekla Structures.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static ModuleManager.ProgramConfigurationEnum Configuration { get; }
Public Shared ReadOnly Property Configuration As ModuleManager.ProgramConfigurationEnum
	Get
Property Value
Type: ModuleManager.ProgramConfigurationEnum
See Also
Reference
ModuleManager Class
Tekla.Structures Namespace